pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
/* NRF24L01 module contains following pins to connect with the controller	
.
 * 
 * CE	->	Chip enable (Activates RX and TX) 
 * CSN	->	SPI chip select signal
 * SCK	->	SPI clock
 * MOSI	->	SPI data input (Master Out Slave Input)
 * MISO	->	SPI data output
 * IRQ	->	Maskable interrupt pin. Active Low
 * 
 * Required SPI operation: (Section 8 nRF24L01 Product Specification)
 * 
 * New command start with HIGH -> LOW on CSN
 * 
 * Command word: 	MSBit to LSBit
 * 
 * Data bytes:		LSByte to MSByte (MSBit first in every byte)
 * 
 * 	
 * =====================================================================
 * 	USAGE TX (Simplest) Steps:
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Define the processor type
 * 				Support: PART_LM4F120H5QR
 *
 * [2]. Call NRF24L01_Init() function with correct SPI settings. (function may changed based on architecture)
 * [3]. Call NRF24L01_SendData() or NRF24L01_SendDataTo() to send data. (TX and RX data sizes should match) - Dynamic payload not supported
 *
 *
 * =====================================================================
 * 	USAGE RX (Simplest) Steps:
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Define the processor type
 * 				Support: PART_LM4F120H5QR
 *
 * [2]. Call NRF24L01_Init() function with correct SPI settings. (function may changed based on architecture)
 * [3]. Set the RX packet size for required pipe using NRF24L01_SetRXPacketSize()
 * [4]. Wait for data using NRF24L01_WaitForDataRx()
 * [5]. Get the amount of received data using NRF24L01_GetRxDataAmount()
 * [6]. Get the received data using NRF24L01_GetData()
 *
 *
 * =====================================================================
 * Change Log
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Initial release.
 * [2]. Contains function support to change all the basic settings.
 * [3]. Supports LM4F120H5QR processor. (Stellaris-launchpad)
 * [4]. Three function levels defined, Simple, Average and Advanced
 * [5]. All the functions are polling based.
 *
 * =====================================================================
 * Known Issues
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Interrupt support is not added.
 * [2]. Dynamic payload support is not added.
 * [3]. Auto ACK with payload support is not added
 *
 * =====================================================================
 * LM4F120H5QR (Stellaris)
 * =====================================================================
 * 
 * Stellaris SSI can be configured as Freescale SPI.
 * 
 * The CSN, SCK, MOSI and MISO pins are analogous to Freescale SPI.
 * 
 * Need to have a separate CE pin.
 * 
 * 
 */
 

#include <stdio.h>
#include <stdlib.h>
#include "inc/hw_types.h"
#include "driverlib/sysctl.h"
#include "driverlib/rom.h"
#include "nRF24L01.h"
#include "pdlib_nrf24l01.h"
#include "pdlib_spi.h"
#include "driverlib/interrupt.h"

#include "uart_debug.h"

static void _NRF24L01_CEHigh();
static void _NRF24L01_CELow();
	

static void _NRF24L01_CSNHigh();
static void _NRF24L01_CSNLow();

#define TYPE_RX		0x01
#define TYPE_TX		0x02

static unsigned long g_ulCEPin;
static unsigned long g_ulCEBase;
static unsigned long g_ulCSNPin;
static unsigned long g_ulCSNBase;

static unsigned char g_ucStatus;


/* PS:
 * 
 * Function		: 	NRF24L01_Init
 * 
 * Arguments	: 	ulCEBase	:	This is the base of the CE pin
 * 					ulCEPin		:	This is the pin to be used for CE
 * 					ulCEPeriph	:	This is the peripheral bit mask
 * 					ulCSNBase	:	This is the base of the CSN pin
 * 					ulCSNPin	:	This is the pin to be used for CSN
 * 					ulCSNPeriph	:	This is the peripheral bit mask
 * 					ucSSIIndex	:	The index of the SSI module
 * 
 * Return		: 	None
 * 
 * Description	: 	The function will initialize the SSI communication 
 * 					for the module. Also the function initializes and
 * 					configures the CE pin. It will reset the registers
 * 					to their default values.
 *
 * 					We cannot use the CSN pin (ie. FSS) in the SSI module
 * 					because we need to keep it LOW throughout the data
 * 					transmission. (ie: Write and Read passes) Therefore
 * 					a different pin should be configured for this purpose
 * 
 */
 	
  
#ifdef PART_LM4F120H5QR

void
NRF24L01_Init(	unsigned long ulCEBase,
				unsigned long ulCEPin,
				unsigned long ulCEPeriph,
				unsigned long ulCSNBase,
				unsigned long ulCSNPin,
				unsigned long ulCSNPeriph,
				unsigned char ucSSIIndex)
{
	//g_ucPdlibStatus = 0x00;
	/* PS: Initialize communication */
#ifdef PDLIB_SPI
	pdlibSPI_ConfigureSPIInterface(ucSSIIndex);
#endif

	/* PS: Set the CE pin */
	g_ulCEBase = ulCEBase;
	g_ulCEPin = ulCEPin;
	
	/* PS: Set the CSN pin */
	g_ulCSNBase = ulCSNBase;
	g_ulCSNPin = ulCSNPin;

	/* PS: Configure the CE pin to be GPIO output */
	ROM_SysCtlPeripheralEnable(ulCEPeriph);
	ROM_GPIOPinTypeGPIOOutput(g_ulCEBase, g_ulCEPin);
	
	_NRF24L01_CELow();

	/* PS: Configure the CSN pin to be GPIO output */
	ROM_SysCtlPeripheralEnable(ulCSNPeriph);
	ROM_GPIOPinTypeGPIOOutput(ulCSNBase, ulCSNPin);

	_NRF24L01_CSNHigh();

	NRF24L01_RegisterInit();

	//g_ucPdlibStatus = 0x01;
}

#endif


/* PS:
 *
 * Function		: 	NRF24L01_InterruptInit
 *
 * Arguments	:	None
 *
 * Return		: 	None
 *
 * Description	:	Registers the IRQ pin as an interrupt
 *
 */

#ifdef NRF24L01_CONF_INTERRUPT_PIN

void NRF24L01_InterruptInit(unsigned long ulIRQBase,
							unsigned long ulIRQPin,
							unsigned long ulIRQPeriph,
							unsigned long ulInterrupt){

	/* PS: Configure the CE pin to be GPIO output */
	ROM_SysCtlPeripheralEnable(ulIRQPeriph);

	ROM_GPIOPinTypeGPIOInput(ulIRQBase, ulIRQPin);
	ROM_GPIOPinIntClear(ulIRQBase, ulIRQPin);
	ROM_GPIOIntTypeSet(ulIRQBase, ulIRQPin, GPIO_FALLING_EDGE);
	ROM_GPIOPinIntEnable(ulIRQBase, ulIRQPin);

	ROM_IntEnable(ulInterrupt);
	ROM_IntMasterEnable();
}

#endif

/* PS:
 *
 * Function		: 	NRF24L01_RegisterInit
 *
 * Arguments	:	None
 *
 * Return		: 	None
 *
 * Description	:	This function will reset the CE pin and reset all the registers.
 *
 */

void
NRF24L01_RegisterInit()
{
	unsigned char ucRxAddr1[5] = {0xE7,0xE7,0xE7,0xE7,0xE7};
	unsigned char ucRxAddr2[5] = {0xC2,0xC2,0xC2,0xC2,0xC2};
	
	NRF24L01_FlushTX();
	NRF24L01_FlushRX();

	_NRF24L01_CELow();

	NRF24L01_RegisterWrite_8(RF24_CONFIG,0x09);
	NRF24L01_RegisterWrite_8(RF24_EN_AA,0x3F);
	NRF24L01_RegisterWrite_8(RF24_EN_RXADDR,0x03);
	NRF24L01_RegisterWrite_8(RF24_SETUP_AW,0x03);
	NRF24L01_RegisterWrite_8(RF24_SETUP_RETR,0x03);
	NRF24L01_RegisterWrite_8(RF24_RF_CH,0x02);
	NRF24L01_RegisterWrite_8(RF24_RF_SETUP,0x0F);
	NRF24L01_RegisterWrite_8(RF24_STATUS,0x70);
	NRF24L01_RegisterWrite_8(RF24_CD, 0x00);
	NRF24L01_RegisterWrite_Multi(RF24_RX_ADDR_P0,ucRxAddr1,5);
	NRF24L01_RegisterWrite_Multi(RF24_RX_ADDR_P1,ucRxAddr2,5);
	NRF24L01_RegisterWrite_8(RF24_RX_ADDR_P2,0xC3);
	NRF24L01_RegisterWrite_8(RF24_RX_ADDR_P3,0xC4);
	NRF24L01_RegisterWrite_8(RF24_RX_ADDR_P4,0xC5);
	NRF24L01_RegisterWrite_8(RF24_RX_ADDR_P5,0xC6);
	NRF24L01_RegisterWrite_Multi(RF24_TX_ADDR,ucRxAddr1,5);
	NRF24L01_RegisterWrite_8(RF24_RX_PW_P0,0x00);
	NRF24L01_RegisterWrite_8(RF24_RX_PW_P1,0x00);
	NRF24L01_RegisterWrite_8(RF24_RX_PW_P2,0x00);
	NRF24L01_RegisterWrite_8(RF24_RX_PW_P3,0x00);
	NRF24L01_RegisterWrite_8(RF24_RX_PW_P4,0x00);
	NRF24L01_RegisterWrite_8(RF24_RX_PW_P5,0x00);
	NRF24L01_RegisterWrite_8(RF24_DYNPD,0x00);
	NRF24L01_RegisterWrite_8(RF24_FEATURE,0x00);
}

/* PS:
 * 
 * Function		: 	NRF24L01_GetStatus
 * 
 * Arguments	: 	None.
 * 
 * Return		: 	Status register value.
 * 
 * Description	: 	Gets the status register of the module
 * 
 */

unsigned char 
NRF24L01_GetStatus()
{
	NRF24L01_RegisterRead_8(RF24_NOP);
	return g_ucStatus;
}

/* PS:
 * 
 * Function		: 	NRF24L01_SetAirDataRate
 * 
 * Arguments	: 	ucDataRate	:	1 for 1 Mbps
 * 									2 for 2 Mbps
 * 
 * Return		: 	None
 * 
 * Description	: 	Sets the air data rate (default 2Mbps)
 * 
 */
 
void
NRF24L01_SetAirDataRate(unsigned char ucDataRate)
{
	unsigned char ucCurrentVal = NRF24L01_RegisterRead_8(RF24_RF_SETUP);

