pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
	NRF24L01_PowerDown();

	return ret;
}

/* PS:
 * 
 * Function		: 	NRF24L01_SetRXAddress
 * 
 * Arguments	: 	ucDataPipe	:	Data pipe number
 * 					pucAddress	:	Buffer which contains the one/five bytes to put to address.
 * 
 * Return		: 	None
 * 
 * Description	: 	Set the RX address. P0 and P1 pipes have 5 byte address
 * 					other pipes have 1 byte address(LSB). Other bytes are taken from
 * 					the P1 pipe address.
 * 
 */
 
void 
NRF24L01_SetRxAddress(	unsigned char ucDataPipe,
						unsigned char *pucAddress)
{
	if(pucAddress)
	{
		switch(ucDataPipe)
		{
			case 0:
			case 1:
				NRF24L01_RegisterWrite_Multi((RF24_RX_ADDR_P0 + ucDataPipe), pucAddress, 5);
				break;
			case 2:
			case 3:
			case 4:
			case 5:
				NRF24L01_RegisterWrite_8((RF24_RX_ADDR_P0 + ucDataPipe),pucAddress[0]);
				break;
			default:
				break;
		}
	}
}


/* PS:
 * 
 * Function		: 	NRF24L01_SetRXPacketSize
 *
 * Arguments	: 	ucDataPipe		:	Data pipe number
 * 					ucPacketSize	:	Packet size. (Maximum is 32)
 *
 * Return		: 	None
 *
 * Description	: 	Set the packet size for a RX pipe.
 *
 */

void
NRF24L01_SetRXPacketSize(	unsigned char ucDataPipe,
							unsigned char ucPacketSize)
{
	if(ucPacketSize < 32)
	{
		NRF24L01_RegisterWrite_8((RF24_RX_PW_P0 + ucDataPipe), ucPacketSize);
	}

}


/* PS:
 *
 * Function		: 	NRF24L01_CarrierDetect
 *
 * Arguments	: 	None
 *
 * Return		: 	'1' - There is a carrier signal
 * 					'0' - There is no carrier signal
 *
 * Description	: 	Check whether there is any RF carrier in the current frequency channel
 *
 */

unsigned char NRF24L01_CarrierDetect(){
	unsigned char ucTemp = NRF24L01_RegisterRead_8(RF24_CD);
	return (ucTemp & 0x01);
}


/* PS:
 *
 * Function		: 	NRF24L01_SetTxPayload
 * 
 * Arguments	: 	pucData		:	Buffer which contains the data to be written to TX fifo
 * 					uiLength	:	Length of the data buffer
 * 
 * Return		: 	PDLIB_NRF24_TX_FIFO_FULL 	: Tx FIFO full
 * 					PDLIB_NRF24_SUCCESS			: Success
 * 
 * Description	: 	Set the TX payload. 
 * 
 */
 
int
NRF24L01_SetTxPayload(	char* pcData,
						unsigned int uiLength)
{
	int ret = PDLIB_NRF24_SUCCESS;

	if(pcData && uiLength > 0)
	{
		// PS: Check whether TX fifo is full
		if(NRF24L01_IsTxFifoFull())
		{
			ret = PDLIB_NRF24_TX_FIFO_FULL;
			PrintString("TX FIFO is full\n\r");
		}else
		{
			NRF24L01_SendCommand(RF24_W_TX_PAYLOAD, pcData, uiLength);
		}
	}else
	{
		ret = PDLIB_NRF24_ERROR;
	}


	return ret;
}


// PS: Implement TX reuse feature
		// TODO

/* PS:
 *
 * Function		: 	NRF24L01_GetData
 *
 * Arguments	:	pipe				:	Pipe number
 * 					pcData [out]		:	Allocated buffer to store the RX data
 * 					length	[in/out]	:	Length in bytes of pcData (only used in dynamic payload mode) // TODO
 *
 * Return		:
 * 					Positive	:	Number of bytes read
 *
 * Description	:
 * 					This function will read the length amount of data from the RX FIFO
 * 					If the available data amount is more than the specified value this
 * 					will return an error.
 *
 * 					Payload is automatically deleted from the FIFO once it is read.
 *
 * 					This will clear the data ready status bit in the module.
 *
 */

int
NRF24L01_GetData(	char pipe,
					char* pcData,
					char *length)
{
	int ret = PDLIB_NRF24_SUCCESS; // Amount of data read
	char cFifoStatus;
	char cTemp;

	// Check whether dynamic payload is available TODO

	if(NULL == pcData)
	{
		ret = PDLIB_NRF24_INVALID_ARGUMENT;
	}else{

		// PS: Validate pipe, Check FIFO status, Get packet size, Read data
		//NRF24L01_GetStatus();
		if(PDLIB_NRF24_SUCCESS == NRF24L01_IsDataReadyRx(&cTemp)){

			if(pipe == cTemp){
				// Get FIFO status
				cFifoStatus = NRF24L01_RegisterRead_8(RF24_FIFO_STATUS);

				// Check whether FIFO is empty
				if(0 == (cFifoStatus & RF24_RX_EMPTY)){

					// PS: Check whether data is available
					cTemp = NRF24L01_GetRxDataAmount(pipe);

					if((*length) >= cTemp){
						(*length) = cTemp;
					}else{
						// PS: If the actual buffer size is smaller than the available data, we can miss data.
						ret = PDLIB_NRF24_BUFFER_TOO_SMALL;
					}

					if(PDLIB_NRF24_SUCCESS == ret){

						// PS: Read RX payload
						NRF24L01_ReadRxPayload(pcData, cTemp);

						// TODO: Check whether we need to check the actual FIFO state before clearing the interrupt.
						// Clear RX_DR
						NRF24L01_GetStatus();
						g_ucStatus |= RF24_RX_DR;
						NRF24L01_RegisterWrite_8(RF24_STATUS, g_ucStatus);
						//NRF24L01_GetStatus();

						ret = cTemp;
					}

				}else{
					ret = PDLIB_NRF24_ERROR;
				}
			}else{
				ret = PDLIB_NRF24_INVALID_ARGUMENT;
			}
		}else{
			ret = PDLIB_NRF24_ERROR;
		}
	}

	return ret;
}

/* PS:
 *
 * Function		: 	NRF24L01_ReadRxPayload
 *
 * Arguments	:	pcData [out]	:	Allocated buffer to store the RX data
 * 					cLength	[in]	:	Required data amount. This should be a valid data amount. (TODO: Verify whether this is neccessary to be valid)
 *
 * Return		:	None
 *
 * Description	:
 * 					This function will read the cLength amount of data from the RX FIFO.
 *
 * 					This function will not perform any validation of data sizes, buffer size, etc.
 *
 * 					Payload is automatically deleted from the FIFO once it is read.
 *
 */

void
NRF24L01_ReadRxPayload(	char* pcData,
						char cLength)
{
	NRF24L01_SendRcvCommand(RF24_R_RX_PAYLOAD, pcData, cLength);
}
 
/* PS:
 * 
 * Function		: 	NRF24L01_
 * 
 * Arguments	: 	
 * 
 * Return		: 	None
 * 
 * Description	: 	
 * 
 */


// ----------------  Normal user level functions ------------------ //

/* PS:
 *
 * Function		: 	NRF24L01_SendData
 *
 * Arguments	: 	pcData		:	Data packet to send
 * 					ulLength	:	Length of the packet
 *
 * Return		:	PDLIB_NRF24_SUCCESS			: Success
 * 					PDLIB_NRF24_TX_FIFO_FULL 	: Tx FIFO full
 *					PDLIB_NRF24_TX_ARC_REACHED	: Maximum retransmissions elapsed
 *
 * Description	: 	The function will send the specified data using
 * 					current configuration. (current air data rate,
 * 					current power, current TX address, ... )
 *
 * 					The function will return after the data is successfully transmitted or
 * 					maximum retransmissions were done. The module will be in Power Down state
 * 					when this function returns.
 *
 */

int NRF24L01_SendData(char *pcData, unsigned int uiLength)
{
	int ret;

	ret = NRF24L01_SubmitData(pcData, uiLength);

	if(ret == PDLIB_NRF24_SUCCESS)
	{

		ret = NRF24L01_AttemptTx();
	}

	return ret;
}


/* PS:
 *
 * Function		: 	NRF24L01_SubmitData
 *
 * Arguments	: 	pcData		:	Data packet to send
 * 					ulLength	:	Length of the packet
 *
 * Return		:	PDLIB_NRF24_SUCCESS			: Success
 * 					PDLIB_NRF24_TX_FIFO_FULL 	: Tx FIFO full
 *
 * Description	: 	The function will send the specified data using
 * 					current configuration. (current air data rate,
 * 					current power, current TX address, ... )
 *
 * 					This function will write data to payload buffer and make
 * 					sure correct addresses are there for automatic ack if available.
 *
 * 					The module needs to be Powered-Up and put into TX mode in order
 * 					to perform the transmission.
 *
 */

int NRF24L01_SubmitData(char *pcData, unsigned int uiLength)
{
	int ret;
	unsigned char address[5];
	unsigned char cTemp;

